Конфигурация/src/Documents/ОтменаБрони/ОтменаБрони.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтменаБрони</name>
  <registerRecords>InformationRegister.БронированиеНомеров</registerRecords>
  <attributes>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/InformationRegisters/БронированиеНомеров/БронированиеНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БронированиеНомеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусБрони</name>
    <type>
      <types>EnumRef.СтатусБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтменаБрони</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Enums/СтатусБронирования/СтатусБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусБронирования</name>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ОтменаБрони/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр БронированиеНомеров
	Движения.БронированиеНомеров.Записывать = Истина;
	Движение = Движения.БронированиеНомеров.Добавить();
	Движение.Период = Дата;
	Движение.Номер = Бронь.БронируемыйНомер;
	Движение.ДатаНачала = Бронь.ДатаЗаезда;
	Движение.ДатаКонца = Бронь.ДатаВыезда; 
	Движение.Гость = Бронь.ОсновнойГость;
	Движение.СтатусБрони = Перечисления.СтатусБронирования.Отменено;
	Движение.ДатаОтменаБрони = Дата;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
